# Урок 2
# Задание 1______________________________________

# a = 15 * 3
# b = 15 / 3
# c = 15 // 2
# d = 15 ** 2
# print(type(a))
# print(type(b))
# print(type(c))
# print(type(d))
#

# Задание 2_________________________________________

# a = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
# for i, q in enumerate(a):
#     if q.isdigit():
#         a[i] = f'"{int(q):02d}"'
#     elif q[1:].isdigit():
#         a[i] = f'"{q[0]}{int(q[1:]):02d}"'
#     print(a[i], end=' ')

# Задание 4 _________________________________________

# lastname =['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
# print('Привет,', lastname[0].title()[-5:], '!')
# print('Привет,', lastname[1].title()[-6:], '!')
# print('Привет,', lastname[2].title()[-7:], '!')
# print('Привет,', lastname[3].title()[-6:], '!')

# Задание 5 ______________________________________________________

# price = [12, 14.50, 17.27, 0.25, 145, 47.18, 46.01, 7.8, 19, 66.68]
# price.sort() or price.reverse()
# for i in price:
#     print(f'{int(i)} rub. {int(i * 100 % 100):02d} kop.', end=',')
